---
kind: other
id: Properties.T:Autodesk.Revit.DB.CurveElement
source: html/70888357-ba77-3b68-67d5-cf1be25262f4.htm
---
# CurveElement Properties

The id of the assembly instance to which the element belongs.